src/talks/index.org
#+SETUPFILE: ../../org-templates/level-1.org
#+TITLE: ~elis/talks/

On this page I link presentation slides and if it exists the recording of me
holding that presentation.

They will be sorted by reversed chronological order (newest first).

* The NixOS Ecosystem -- A brief overview
 - Date: [2020-02-22]
 - Location: Oslo NixOS Meetup

[[https://github.com/etu/presentations/blob/master/oslo-nixos-meetup-2020-02-22/presentation.org][Org file used for slides]]. [[https://www.youtube.com/watch?v=9Su89RLoh0Q][Youtube video]].

* Lightning talk: EXWM -- Emacs X11 Window Manager
 - Date: [2019-12-29]
 - Location: 36c3 Lightningtalks track

[[https://github.com/etu/presentations/blob/master/cfp-36c3-lightningtalk-exwm/presentation.org][Org file used for slides]]. [[https://www.youtube.com/watch?v=qbtr_a7vBXw&t=1418s][Youtube with timestamp]]. [[https://media.ccc.de/v/36c3-10525-lightning_talks_day_3#t=1418][media.ccc.de with timestamp]].

* Emacs X11 Window Manager
 - Date: [2019-03-20]
 - Meetup: Stockholm Emacs Meetup

[[https://github.com/etu/presentations/blob/master/stockholm-emacs-meetup-2019-03-20/presentation.org][Org file used for slides]].

* Interactive presentation of Magit
 - Date: [2018-11-28]
 - Meetup: Stockholm Emacs Meetup

I held this at the revival event of Stockholm Emacs Meetup when I took over
that group.

[[https://github.com/etu/presentations/blob/master/stockholm-emacs-meetup-2018-11-28/presentation.org][Org file used for slides]]. [[https://github.com/etu/presentations/blob/master/stockholm-emacs-meetup-2018-11-28/shopping-list.org][Org file used for live demo]].
