talks/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-05-23 Sun 15:02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>~elis/talks/</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Elis Hirwing &lt;elis@hirwing.se&gt;">
<link href="https://elis.nu/" rel="canonical">
<link rel="stylesheet" type="text/css" href="/style.css" />
<link rel="alternate" type="application/rss+xml" title="~elis/blog/" href="/blog/rss.xml" />
<link rel="icon" href="/imgs/favicon.jpg">
<meta name="referrer" content="no-referrer" />
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status">
<nav>
     <ul>
       <li><a href="/">~elis/</a></li>
       <li><a href="/about/">./about/</a></li>
       <li><a href="/work/">./work/</a></li>
       <li><a href="/talks/">./talks/</a></li>
       <li><a href="/blog/">./blog/</a></li>
     </ul>
   </nav>
</div>
<div id="content">
<h1 class="title">~elis/talks/</h1>
<p>
On this page I link presentation slides and if it exists the recording of me
holding that presentation.
</p>

<p>
They will be sorted by reversed chronological order (newest first).
</p>

<article id="outline-container-org451f6b9" class="outline-2">
<h2 id="org451f6b9">The NixOS Ecosystem &#x2013; A brief overview</h2>
<div class="outline-text-2" id="text-org451f6b9">
<ul class="org-ul">
<li>Date: <span class="timestamp-wrapper"><span class="timestamp">[2020-02-22 Sat]</span></span></li>
<li>Location: Oslo NixOS Meetup</li>
</ul>

<p>
<a href="https://github.com/etu/presentations/blob/master/oslo-nixos-meetup-2020-02-22/presentation.org">Org file used for slides</a>. <a href="https://www.youtube.com/watch?v=9Su89RLoh0Q">Youtube video</a>.
</p>
</div>
</article>

<article id="outline-container-orgc31d761" class="outline-2">
<h2 id="orgc31d761">Lightning talk: EXWM &#x2013; Emacs X11 Window Manager</h2>
<div class="outline-text-2" id="text-orgc31d761">
<ul class="org-ul">
<li>Date: <span class="timestamp-wrapper"><span class="timestamp">[2019-12-29 Sun]</span></span></li>
<li>Location: 36c3 Lightningtalks track</li>
</ul>

<p>
<a href="https://github.com/etu/presentations/blob/master/cfp-36c3-lightningtalk-exwm/presentation.org">Org file used for slides</a>. <a href="https://www.youtube.com/watch?v=qbtr_a7vBXw&amp;t=1418s">Youtube with timestamp</a>. <a href="https://media.ccc.de/v/36c3-10525-lightning_talks_day_3#t=1418">media.ccc.de with timestamp</a>.
</p>
</div>
</article>

<article id="outline-container-org62c514e" class="outline-2">
<h2 id="org62c514e">Emacs X11 Window Manager</h2>
<div class="outline-text-2" id="text-org62c514e">
<ul class="org-ul">
<li>Date: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-20 Wed]</span></span></li>
<li>Meetup: Stockholm Emacs Meetup</li>
</ul>

<p>
<a href="https://github.com/etu/presentations/blob/master/stockholm-emacs-meetup-2019-03-20/presentation.org">Org file used for slides</a>.
</p>
</div>
</article>

<article id="outline-container-org2a6108a" class="outline-2">
<h2 id="org2a6108a">Interactive presentation of Magit</h2>
<div class="outline-text-2" id="text-org2a6108a">
<ul class="org-ul">
<li>Date: <span class="timestamp-wrapper"><span class="timestamp">[2018-11-28 Wed]</span></span></li>
<li>Meetup: Stockholm Emacs Meetup</li>
</ul>

<p>
I held this at the revival event of Stockholm Emacs Meetup when I took over
that group.
</p>

<p>
<a href="https://github.com/etu/presentations/blob/master/stockholm-emacs-meetup-2018-11-28/presentation.org">Org file used for slides</a>. <a href="https://github.com/etu/presentations/blob/master/stockholm-emacs-meetup-2018-11-28/shopping-list.org">Org file used for live demo</a>.
</p>
</div>
</article>
</div>
<div id="postamble" class="status">
<p class="author">Author: Elis Hirwing &lt;elis@hirwing.se&gt;</p>
<p class="date">Created: 2021-05-23 Sun 15:02</p>
</div>
</body>
</html>
